EDT.СЭ_Доработки/src/Documents/КадровыйПеревод/КадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f3711e5-69f1-406d-b6f7-9e1d9ebc4707">
  <name>КадровыйПеревод</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="31cabfea-261c-4cfa-a268-e0780f17f0b4">
    <name>СрочныйДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8dcb780f-435e-47bd-a85c-87e140b04614">
    <name>СЭ_ТипДополнительногоСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a82a1d77-9c7a-408d-b2d5-717ff99a5685">
    <name>СЭ_ДатаДопСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf8ca40d-d8ba-4aa6-8843-42984ef1fa3e">
    <name>СЭ_НомерДопСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2e23147f-5fa0-466e-b3d9-14b554c1d2db">
    <name>СЭ_ДобавитьИзменитьДопСоглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

EDT.СЭ_Доработки/src/Documents/КадровыйПеревод/Forms/ФормаДокумента/Module.bsl
//+СЭ Пилипчук 0016039
&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере()
	//СЭ Пилипчук 0016187
	Элементы.СрочныйДоговор.Заголовок = "Срок действия до";
	//СЭ Пилипчук 0016187
	
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ДатаНомер", Объект.Ссылка); 
	
	//СЭ Ульяна 0016035 
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыФормы(Элементы);
	Если Объект.СЭ_ДобавитьИзменитьДопСоглашение тогда
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Истина; 
	Иначе
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Ложь;    
	КонецЕсли;
	//СЭ Ульяна 0016035
	
КонецПроцедуры   

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
КонецПроцедуры
 //-СЭ Пилипчук 0016039 
 
 
 //СЭ Ульяна 0016035 
 
 &НаКлиенте
 Процедура СЭ_ДобавитьИзменитьДопСоглашениеПриИзменении(Элемент)  
	 
	 Если Объект.СЭ_ДобавитьИзменитьДопСоглашение тогда
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Истина; 
	 Иначе
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Ложь;    
		Объект.СЭ_ТипДополнительногоСоглашения                = ПредопределенноеЗначение("Справочник.СЭ_ТипыДополнительныхСоглашений.ПустаяСсылка");
		Объект.СЭ_ДатаДопСоглашения                           = Дата(1,1,1);
		Объект.СЭ_НомерДопСоглашения                          = 0;
	 КонецЕсли;
	 
 КонецПроцедуры
 
 //СЭ Ульяна 0016035
